In [3]:
import pandas as pd

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=["A", "B", "C"])

In [5]:
df.head(2)

   A  B  C
0  1  2  3
1  4  5  6

In [6]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [7]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [3]:
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [4]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [28]:
results = pd.read_parquet('./data/results.parquet')
bios = pd.read_csv('./data/bios.csv')

In [6]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [11]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [15]:
coffee.loc[5:12, ["Day", "Units Sold"]]

          Day  Units Sold
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45

In [16]:
coffee.iloc[:,[0]]

          Day
0      Monday
1      Monday
2     Tuesday
3     Tuesday
4   Wednesday
5   Wednesday
6    Thursday
7    Thursday
8      Friday
9      Friday
10   Saturday
11   Saturday
12     Sunday
13     Sunday

In [18]:
coffee.sort_values("Units Sold", ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [19]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [21]:
bios.loc[bios['height_cm'] > 220]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN

In [29]:
bios.loc[(bios['born_country'] == 'PAK') & (bios['born_city'] == 'Sialkot')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19830,19969,Kamran Ashraf,1973-09-30,Sialkot,Punjab,PAK,Pakistan,171.0,65.0,NaN
19832,19971,Asif Bajwa,1972-06-08,Sialkot,Punjab,PAK,Pakistan,NaN,NaN,NaN
19881,20021,Manzoor Hussain,1958-10-28,Sialkot,Punjab,PAK,Pakistan,173.0,73.0,2022-08-29
19902,20043,Nasir Ali,1959-01-01,Sialkot,Punjab,PAK,Pakistan,176.0,69.0,NaN
19923,20065,Shahnaz Sheikh,1949-03-21,Sialkot,Punjab,PAK,Pakistan,172.0,74.0,NaN
19924,20066,Tariq Sheikh,1968-12-11,Sialkot,Punjab,PAK,Pakistan,160.0,57.0,NaN
19935,20077,Muhammad Zahid Sheikh,1949-12-14,Sialkot,Punjab,PAK,Pakistan,165.0,85.0,2010-01-29
43263,43597,Saifi Chaudhry,1929-11-15,Sialkot,Punjab,PAK,Pakistan,177.0,88.0,NaN
91922,92653,Muhammad Akram,1971-02-02,Sialkot,Punjab,PAK,Pakistan,180.0,72.0,NaN
112649,113927,Muhammad Waqas,1988-09-03,Sialkot,Punjab,PAK,Pakistan,178.0,65.0,NaN
119480,121298,Fareed Ahmed,1989-04-28,Sialkot,Punjab,PAK,Pakistan,NaN,NaN,NaN

In [40]:
bios[bios['name'].str.contains("Awais", case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
48424,48777,Tatsugo Kawaishi,1911-12-10,NaN,NaN,NaN,Japan,NaN,NaN,1945-03-17

In [42]:
bios.query('born_country == "PAK" and born_city == "Sialkot"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
19830,19969,Kamran Ashraf,1973-09-30,Sialkot,Punjab,PAK,Pakistan,171.0,65.0,NaN
19832,19971,Asif Bajwa,1972-06-08,Sialkot,Punjab,PAK,Pakistan,NaN,NaN,NaN
19881,20021,Manzoor Hussain,1958-10-28,Sialkot,Punjab,PAK,Pakistan,173.0,73.0,2022-08-29
19902,20043,Nasir Ali,1959-01-01,Sialkot,Punjab,PAK,Pakistan,176.0,69.0,NaN
19923,20065,Shahnaz Sheikh,1949-03-21,Sialkot,Punjab,PAK,Pakistan,172.0,74.0,NaN
19924,20066,Tariq Sheikh,1968-12-11,Sialkot,Punjab,PAK,Pakistan,160.0,57.0,NaN
19935,20077,Muhammad Zahid Sheikh,1949-12-14,Sialkot,Punjab,PAK,Pakistan,165.0,85.0,2010-01-29
43263,43597,Saifi Chaudhry,1929-11-15,Sialkot,Punjab,PAK,Pakistan,177.0,88.0,NaN
91922,92653,Muhammad Akram,1971-02-02,Sialkot,Punjab,PAK,Pakistan,180.0,72.0,NaN
112649,113927,Muhammad Waqas,1988-09-03,Sialkot,Punjab,PAK,Pakistan,178.0,65.0,NaN
119480,121298,Fareed Ahmed,1989-04-28,Sialkot,Punjab,PAK,Pakistan,NaN,NaN,NaN

In [44]:
coffee['price'] = 2.9

In [46]:
import numpy as np

coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)

In [50]:
coffee.drop(columns=['price'], inplace=True)

In [52]:
coffee = coffee[['Day', 'Coffee Type', 'Units Sold']]

In [54]:
coffee['prrice'] = 2.99

In [56]:
coffee['revenue'] = coffee['Units Sold'] * coffee['prrice']

In [58]:
coffee = coffee.rename(columns={'prrice':'price'})

In [59]:
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   2.99    74.75
1      Monday       Latte          15   2.99    44.85
2     Tuesday    Espresso          30   2.99    89.70
3     Tuesday       Latte          20   2.99    59.80
4   Wednesday    Espresso          35   2.99   104.65
5   Wednesday       Latte          25   2.99    74.75
6    Thursday    Espresso          40   2.99   119.60
7    Thursday       Latte          30   2.99    89.70
8      Friday    Espresso          45   2.99   134.55
9      Friday       Latte          35   2.99   104.65
10   Saturday    Espresso          45   2.99   134.55
11   Saturday       Latte          35   2.99   104.65
12     Sunday    Espresso          45   2.99   134.55
13     Sunday       Latte          35   2.99   104.65

In [5]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [7]:
bios_new = bios.copy()

In [8]:
bios_new['firts_name'] = bios_new['name'].str.split(' ').str[0]

In [9]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firts_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [10]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])

In [13]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year
bios_new[['name','born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [14]:
bios_new.to_csv('./data/new_bios.csv')

In [15]:
bios_new['height_category'] = bios_new['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firts_name,born_datetime,born_year,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall

In [16]:
def categoraize_athelete(row):
    if row['height_cm']  < 175 and row['weight_kg'] <70:
        return 'Lightweight'
    elif row['height_cm']  < 185 and row['weight_kg'] <80:
        return 'Middleweight'
    else:
        return 'Heavywight'
    
bios_new['Category'] = bios_new.apply(categoraize_athelete, axis=1)

In [17]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firts_name,born_datetime,born_year,height_category,Category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886-12-12,1886.0,Tall,Heavywight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall,Heavywight
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,Average,Lightweight
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,Average,Lightweight
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,Short,Lightweight
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,1899-05-19,1899.0,Average,Heavywight
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0,Tall,Heavywight

In [18]:
nocs = pd.read_csv('./data/noc_regions.csv')
nocs

     NOC       region                 notes
0    AFG  Afghanistan                   NaN
1    AHO      Curacao  Netherlands Antilles
2    ALB      Albania                   NaN
3    ALG      Algeria                   NaN
4    AND      Andorra                   NaN
..   ...          ...                   ...
225  YEM        Yemen                   NaN
226  YMD        Yemen           South Yemen
227  YUG       Serbia            Yugoslavia
228  ZAM       Zambia                   NaN
229  ZIM     Zimbabwe                   NaN

[230 rows x 3 columns]

In [19]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [20]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,RUS,Russia,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,FRA,France,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,AUS,Australia,NaN

In [22]:
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,RUS,Russia,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,FRA,France,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,AUS,Australia,NaN

In [24]:
bios[bios['born_country'] == 'PAK']['born_city'].value_counts()

born_city
Lahore              32
Faisalabad          20
Karachi             20
Rawalpindi          13
Sialkot             11
Quetta              10
Gojra                8
Sheikhupura          6
Gujranwala           6
Bahawalpur           5
Peshawar             4
Bannu                4
Murree               3
Hyderabad            3
Abbottabad           2
Multan               2
Vehari               2
Sargodha             2
Gilgit               2
Okara                2
Toba Tek Singh       2
Kohat                1
Shergarh             1
Khandoyah            1
Dulmial              1
Nankana Sahib        1
Mianwali             1
Talagang             1
Dera Ismail Khan     1
Gujrat               1
Islamabad            1
Sahiwal              1
Jhelum               1
Jand                 1
Khairpur             1
Dalwala Mela         1
Murid                1
Chichawatni          1
Nathot               1
Dawari               1
Dhok Badhal          1
Shakargarh           1
Chakwal              1
Naushahro Firoz      1
Khanewal             1
Karak                1
Hasan Abdal          1
Pir Mahal            1
Kasur                1
Name: count, dtype: int64

In [29]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios.groupby(bios['born_date'].dt.year)['name'].count().reset_index().sort_values('name', ascending=False)

     born_date  name
139     1972.0  2231
152     1985.0  2227
140     1973.0  2216
138     1971.0  2205
137     1970.0  2174
..         ...   ...
4       1837.0     1
2       1833.0     1
6       1839.0     1
12      1845.0     1
176     2009.0     1

[177 rows x 2 columns]